README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-17 Thu 21:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pedro Abelleira Seco" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1763eba">1. What is pluggable</a></li>
<li><a href="#org22a3431">2. Why</a></li>
<li><a href="#org526d980">3. How</a></li>
</ul>
</div>
</div>
<div id="outline-container-org1763eba" class="outline-2">
<h2 id="org1763eba"><span class="section-number-2">1</span> What is pluggable</h2>
<div class="outline-text-2" id="text-1">
<p>
<code>Pluggable</code> is a nano framework (&lt;70 lines of code) implementing a plugin
architecture for Clojure(Script) applications.
</p>

<p>
<code>Pluggable</code> is very general. It supports the creation of plugin architectures, but
there is little imposed in how to actually do it. The only requirement is that a
plugin is a map with a key 'id' and, optionally, a key 'loader'. Plugins can
define new keys with arbitrary meanings, which are available to plugins loaded
afterwards. An application built in this style is simply a collection of
plugins, each one having access to the functionality of the plugins defined
beforehand and defining new functionality and extension points for the plugins
loaded afterwards. 
</p>

<p>
It's simply impossible to understand how this can be used in practice
without good examples. Good examples should be, of course, realistic. It's not
realistic to use this kind of architectures in small, 'todo's' type of applications.
My plan is to write a realistic mid-size application using this library
as an example of how this approach can be used in real world scenarios. 
</p>

<p>
To get a taste of how a plugin for a part of an application can look like when
using this library. This is a plugin definition for a router plugin for SPAs:
</p>

<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #fb4934; font-weight: bold;">def</span> <span style="color: #8ec07c;">plugin</span>
  {<span style="color: #d3869b;">:id</span>         <span style="color: #d3869b;">::routing</span>
   <span style="color: #d3869b;">:loader</span>     #'loader
   <span style="color: #d3869b;">:beans</span>      {<span style="color: #d3869b;">:main-component</span> [vector #'current-page <span style="color: #d3869b;">::router</span> <span style="color: #d3869b;">:ui-page-template</span><span style="color: #7c6f64;">]</span>
                <span style="color: #d3869b;">::router</span>        {<span style="color: #d3869b;">:constructor</span> [#'create-router<span style="color: #7c6f64;">]</span>
                                 <span style="color: #d3869b;">:mutators</span>    [[#'init-router <span style="color: #d3869b;">::routes</span><span style="color: #7c6f64;">]]}</span>
                <span style="color: #d3869b;">::about-page</span>    about-page<span style="color: #7c6f64;">}</span>
   <span style="color: #d3869b;">::routes</span>    [[<span style="color: #b8bb26;">"/about"</span>
                 {<span style="color: #d3869b;">:name</span> <span style="color: #d3869b;">::about-page</span>
                  <span style="color: #d3869b;">:view</span> <span style="color: #d3869b;">::about-page</span><span style="color: #7c6f64;">}]]</span>
   <span style="color: #d3869b;">::home-page</span> #'ui-home-page<span style="color: #7c6f64;">})</span>
</pre>
</div>

<p>
This plugin defines two extension points (<code>::routes</code> and <code>::home-page</code>) and
defines default values. Other plugins can use this extension points to overwrite
the home page or add routes to the application. The code that process this
extension points is defined in the loader function (code now shown).
</p>

<p>
If you wonder what the <code>:beans</code> key means, this is a key defined by another
plugin not shown here that defines this extension points to allow plugins to
define 'beans' to be processed by the Injectable library. That library is not a
requirement for <code>Pluggable</code>, but I personally use the two together.
</p>
</div>
</div>

<div id="outline-container-org22a3431" class="outline-2">
<h2 id="org22a3431"><span class="section-number-2">2</span> Why</h2>
<div class="outline-text-2" id="text-2">
<p>
Because it's a lot of fun to develop applications as a series of plugins.
</p>

<p>
From a less subjective point of view, we have seen repeatedly than, sooner than
later, an application incurres on a "growing tax", where adding  
new functionality becomes increasingly costly and working with that codebase is
painful. 
</p>

<p>
The standard strategy to deal with this problem is to change projects, jobs or
career paths. That works for individuals, but normally not for projects or organisations.
These usually follow the strategy to adopt modularity. A plugin
architecture is a form of modularity optimised for making application
extensivility easy. 
</p>

<p>
I became familiarized with this style of development when launching the project
Monodevelop, which started as a port of the #Develop IDE to Linux. The plugin
architecture of #Develop made the port easy to do, one module at a time, and the
code easier to understand.
</p>

<p>
All big commercial applications use some kind of plugin architecture. The main
reason is to allow third party developers to add functionality to the platform
even without access to the source code. But open source software also usually
embraces that style, in some cases in a radical style where all the
functionality of the application is implemented via plugins (e.g. Eclipse).
</p>

<p>
My main reason to adopt this style of development is that it's a <i>lot</i> of fun to
develop like this.  
</p>
</div>
</div>

<div id="outline-container-org526d980" class="outline-2">
<h2 id="org526d980"><span class="section-number-2">3</span> How</h2>
<div class="outline-text-2" id="text-3">
<p>
This technique comes from the object oriented world, even if it can be applied
with a functional flavor. The object orientation of the philosophy is not bad in
itself:
</p>

<p>
<a href="https://www.youtube.com/watch?v=HSk5fdKbd3o">https://www.youtube.com/watch?v=HSk5fdKbd3o</a> 
</p>

<p>
<code>Pluggable</code> targets the set up of the application state/configuration and stops
there. It is therefore purely functional. Nevertheless, the constructed
state/configuration can be arbitrarily rich and contain any kind of elements. 
</p>

<p>
This nano framework consists in one function, that takes an initial
value for the map and a list of plugins and returns the transformed map.
Conceptually, <code>Pluggable</code> is a function 'f' which takes a collection and an
initial state and applies each of the plugins to transform the state:
</p>

<p>
(f state plugins) -&gt; state
</p>

<p>
This means that <code>Pluggable</code> is a simply a reducer. 
</p>

<p>
Its power comes from the fact that every plugin can define it's own extension
points so other plugins can tap into them and also define their own extension
points. But that a story for another day.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Pedro Abelleira Seco</p>
<p class="date">Created: 2020-09-17 Thu 21:57</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
